[net]

batch=128

subdivisions=1

height=56

width=56

channels=3

max_crop=60

min_crop=60


hue=.1

saturation=.75

exposure=.75


learning_rate=0.5

policy=poly

power=4

max_batches = 5000

momentum=0.9

decay=0.0005


[convolutional]

batch_normalize=1

filters=6

size=3

stride=1

pad=1

activation=relu


[maxpool]

size=2

stride=2


[convolutional]

batch_normalize=1

filters=16

size=3

stride=1

activation=relu

[maxpool]

size=2

stride=2


[convolutional]

batch_normalize=1

filters=32

size=3

stride=1

activation=relu


[convolutional]

batch_normalize=1

filters=6

size=3

stride=1

activation=relu


[maxpool]

size=2

stride=2


[connected]

output=300

activation=relu


[connected]

output=300

activation=relu


[connected]

output=2

activation=linear


[softmax]
